<?php
declare(strict_types=1);

namespace App\Constant;

/**
 * 国名定数クラス
 * 
 * @package App\Constant
*/
class CountryConstant
{
    /**
     * 国名：アイスランド共和国
     *
     * @var int
     */
    public const COUNTRY_LIST = [
        1 => 'アイスランド共和国',
        2 => 'アイルランド',
        3 => 'アゼルバイジャン共和国',
        4 => 'アフガニスタン',
        5 => 'アメリカ合衆国',
        6 => 'アラブ首長国連邦',
        7 => 'アルジェリア民主人民共和国',
        8 => 'アルゼンチン共和国',
        9 => 'アルバニア共和国',
        10 => 'アルメニア共和国',
        11 => 'アンゴラ共和国',
        12 => 'アンティグア・バーブーダ',
        13 => 'アンドラ',
        14 => 'イエメン共和国',
        15 => 'イスラエル国',
        16 => 'イタリア共和国',
        17 => 'イラク共和国',
        18 => 'イラン・イスラム共和国',

    ];
}